{"source":"stephenmk/yomitan-jlpt-vocab (Tanos JLPT lists, jmdict-aligned)","sourced_at":"2026-04-29","note":"Levels 5..1 (5=N5 basic, 1=N1 advanced). Built basic-first so lowest-level (most basic) wins on conflict.","by_jmdict_seq":{"1198180":5,"1381380":5,"1381390":5,"2013900":5,"1383240":5,"1532350":5,"1332650":5,"1586270":5,"1202450":5,"1352320":5,"1428280":5,"1586330":5,"1584640":5,"1404630":5,"1584660":5,"1000320":5,"1542160":5,"1586420":5,"1582310":5,"1361490":5,"1483185":5,"1343460":5,"1467720":5,"1275320":5,"1269320":5,"1223615":5,"1249900":5,"1307630":5,"1000430":5,"1017760":5,"1547450":5,"1218380":5,"1213400":5,"1584930":5,"1171900":5,"1153520":5,"1390930":5,"1296400":5,"1514320":5,"2847612":5,"2820690":5,"1605820":5,"1583250":5,"1587040":5,"1191730":5,"2845606":5,"1578850":5,"1219960":5,"1219980":5,"1421700":5,"1159980":5,"1157070":5,"1519290":5,"1432680":5,"1160790":5,"1576260":5,"1165970":5,"1188760":5,"1268570":5,"1163400":5,"1268070":5,"1188890":5,"1258330":5,"1288850":5,"1156800":5,"1524590":5,"1587610":5,"1582820":5,"1577980":5,"1546640":5,"1465610":5,"1357600":5,"1587850":5,"1352130":5,"1269410":5,"1475480":5,"1193180":5,"1588120":5,"1378690":5,"1201190":5,"1473950":5,"1481920":5,"1580340":5,"1202270":5,"1173720":5,"1173750":5,"1174420":5,"1001140":5,"1175140":5,"1030630":5,"1178590":5,"1486650":5,"1407460":5,"1588880":5,"1412890":5,"1414220":5,"1002650":5,"1001710":5,"1001820":5,"1223640":5,"1421850":5,"1179330":5,"1329015":5,"1299685":5,"1002320":5,"1236900":5,"2261490":5,"1180470":5,"1421970":5,"1002430":5,"1002100":5,"1002590":5,"1581930":5,"1419990":5,"1420010":5,"1576050":5,"1576060":5,"1414170":5,"1002610":5,"1451750":5,"1001830":5,"1001990":5,"1002330":5,"2261500":5,"2220600":5,"1513065":5,"1206050":5,"1002120":5,"1335750":5,"1533580":5,"1174340":5,"1589500":5,"1589600":5,"1183720":5,"1344930":5,"1344970":5,"1203620":5,"1203650":5,"1198550":5,"1203090":5,"1589730":5,"1473740":5,"1512130":5,"1221270":5,"1207590":5,"1260490":5,"1343950":5,"1206900":5,"1207610":5,"1301940":5,"1411160":5,"1499720":5,"1583720":5,"1192150":5,"1516925":5,"1206730":5,"1037670":5,"1192280":5,"1206110":5,"1208910":5,"1194870":5,"1311530":5,"1038350":5,"1194290":5,"1365850":5,"1409140":5,"1323560":5,"1252560":5,"1039140":5,"1039220":5,"1390020":5,"1577200":5,"1213170":5,"1534520":5,"1576760":5,"1182030":5,"1350040":5,"1591110":5,"1520670":5,"1042820":5,"1178940":5,"1226440":5,"1385070":5,"1385170":5,"1579260":5,"1578150":5,"1231580":5,"1231590":5,"1579110":5,"1237150":5,"1249960":5,"1231690":5,"1257240":5,"1384830":5,"1423000":5,"1591900":5,"1042610":5,"1042620":5,"1042650":5,"1243490":5,"1243320":5,"1538160":5,"1184270":5,"1193060":5,"1275640":5,"1246700":5,"1246740":5,"1592250":5,"1592340":5,"1457560":5,"1154330":5,"1044070":5,"1046810":5,"1547720":5,"1323080":5,"1287410":5,"1287420":5,"1252330":5,"1579100":5,"1350110":5,"1254760":5,"1254790":5,"1255890":5,"1263400":5,"1260720":5,"1268060":5,"1273270":5,"1592970":5,"1280770":5,"1272500":5,"1380440":5,"1049000":5,"1049180":5,"1288810":5,"1268990":5,"1243850":5,"1243600":5,"1269060":5,"1449540":5,"1004500":5,"2846389":5,"1579130":5,"1264540":5,"1307850":5,"1582920":5,"1270590":5,"1050590":5,"1289590":5,"2216120":5,"1289100":5,"1289220":5,"1004880":5,"1289470":5,"1005110":5,"1296970":5,"1578010":5,"1387210":5,"1297210":5,"1297960":5,"1291330":5,"1299400":5,"1291600":5,"1210360":5,"1293660":5,"1579350":5,"1303620":5,"1579470":5,"1576630":5,"1505990":5,"1315920":5,"1304970":5,"1318970":5,"1381820":5,"1184140":5,"1319210":5,"1320760":5,"1318290":5,"1318400":5,"1310730":5,"1315140":5,"1318610":5,"1436560":5,"1508590":5,"1436570":5,"1005900":5,"1321900":5,"1061520":5,"1061820":5,"1579840":5,"1330290":5,"1337270":5,"1353320":5,"1580480":5,"1595020":5,"1358550":5,"1420470":5,"1474900":5,"1474910":5,"1362360":5,"1372190":5,"1228260":5,"1067470":5,"1277450":5,"1348910":5,"1430620":5,"1348870":5,"1554370":5,"1070790":5,"1072590":5,"1073210":5,"1074260":5,"1334040":5,"1073900":5,"1157170":5,"1291800":5,"2147990":5,"1379380":5,"1074270":5,"1382590":5,"1472740":5,"1237680":5,"2839962":5,"1388740":5,"1387500":5,"1387870":5,"1387990":5,"1390980":5,"1396130":5,"1399790":5,"1612860":5,"1006730":5,"1006670":5,"1006780":5,"1203250":5,"1006830":5,"1403830":5,"1245290":5,"2216210":5,"1006980":5,"1406050":5,"1413240":5,"1413890":5,"1414150":5,"1413660":5,"1414340":5,"1412640":5,"1415000":5,"1283190":5,"1415870":5,"1076190":5,"1338180":5,"1597040":5,"1335640":5,"1257540":5,"1207240":5,"1548370":5,"1597150":5,"1407980":5,"1358340":5,"1358280":5,"1549140":5,"1416830":5,"1416840":5,"1419110":5,"2546180":5,"1347750":5,"2136180":5,"1242130":5,"1158880":5,"1242160":5,"1420900":5,"1421290":5,"1422720":5,"1597530":5,"1427340":5,"1163940":5,"2225040":5,"1305990":5,"1483740":5,"1316380":5,"1422970":5,"1220210":5,"1597890":5,"1495770":5,"1240825":5,"1008190":5,"1556730":5,"1236070":5,"1327190":5,"1078750":5,"1078630":5,"1078810":5,"1598550":5,"1327720":5,"1340450":5,"1338850":5,"1079760":5,"1008450":5,"1083590":5,"1008460":5,"1338240":5,"1080510":5,"1438690":5,"1443000":5,"1443530":5,"1443840":5,"1266970":5,"1087820":5,"1084810":5,"1008910":5,"1466940":5,"1189130":5,"1451470":5,"1009000":5,"1177800":5,"1335000":5,"1598680":5,"1316140":5,"1577140":5,"1343100":5,"1468060":5,"1370420":5,"1189360":5,"1008630":5,"1189370":5,"1555830":5,"1920240":5,"1429700":5,"1310620":5,"1540170":5,"1445590":5,"1430250":5,"1253020":5,"1326980":5,"1298790":5,"1009290":5,"1089890":5,"1423310":5,"1429750":5,"1532870":5,"1529530":5,"1577120":5,"1191320":5,"1191420":5,"1582300":5,"1319220":5,"1579630":5,"1531710":5,"1333070":5,"1508380":5,"1508390":5,"1375610":5,"2846738":5,"1577100":5,"1461140":5,"1463480":5,"1463520":5,"1380840":5,"1464900":5,"1195430":5,"1091500":5,"1436130":5,"1416400":5,"1183300":5,"1092820":5,"1467640":5,"1360010":5,"1093450":5,"1352570":5,"1600430":5,"1169870":5,"1355120":5,"1313000":5,"1100760":5,"1010080":5,"1201940":5,"1465590":5,"1546590":5,"1607260":5,"1585650":5,"1237410":5,"1476410":5,"1307500":5,"1342540":5,"1342550":5,"1402540":5,"1098390":5,"1098620":5,"1600790":5,"1451150":5,"1583090":5,"1600850":5,"1194500":5,"1486720":5,"1600900":5,"1562350":5,"1404975":5,"1341000":5,"1427900":5,"1376460":5,"1376470":5,"1478750":5,"1482110":5,"1103090":5,"1096420":5,"1482290":5,"1601340":5,"1479890":5,"1447440":5,"1169250":5,"1419370":5,"1434180":5,"1485470":5,"1290800":5,"1580640":5,"1160820":5,"1162130":5,"1576150":5,"1577280":5,"1488000":5,"1490220":5,"1490230":5,"1426250":5,"1602340":5,"1278410":5,"1109380":5,"1499690":5,"1115150":5,"1110110":5,"1370760":5,"1500940":5,"1461160":5,"1457440":5,"1582670":5,"1462900":5,"1408180":5,"1446070":5,"1282790":5,"1265070":5,"1500100":5,"1505470":5,"1120410":5,"1185200":5,"1119650":5,"1120990":5,"1499320":5,"1512070":5,"1121380":5,"1512670":5,"1512610":5,"1519170":5,"1123590":5,"1203260":5,"1124970":5,"1547330":5,"1125150":5,"1295510":5,"1182880":5,"1122650":5,"1522150":5,"1522980":5,"1523060":5,"1524700":5,"1584350":5,"1524690":5,"1524720":5,"1584360":5,"1524730":5,"1392580":5,"1239730":5,"1495000":5,"1524930":5,"1527110":5,"1603990":5,"1410590":5,"1580600":5,"2784220":5,"1401400":5,"1604230":5,"1584460":5,"1526360":5,"1523940":5,"1171010":5,"1418620":5,"1371260":5,"1582120":5,"1259210":5,"1454080":5,"1301330":5,"1299740":5,"1555300":5,"1202170":5,"1459870":5,"1317170":5,"1259290":5,"1202150":5,"1561470":5,"1277140":5,"1460850":5,"1585315":5,"1406820":5,"1604890":5,"1132570":5,"1577670":5,"1012480":5,"2005860":5,"1534890":5,"1315720":5,"1012620":5,"1502390":5,"1584800":5,"1536010":5,"1476960":5,"1537370":5,"1157000":5,"1153670":5,"1227500":5,"1227560":5,"1583095":5,"1302680":5,"1012980":5,"1542790":5,"1584910":5,"1542430":5,"1542640":5,"1541620":5,"1386500":5,"1013050":5,"1476920":5,"1546020":5,"1605870":5,"1180570":5,"1307320":5,"1307040":5,"1266440":5,"1456360":5,"1536350":5,"1324520":5,"1547900":5,"1548010":5,"1548220":5,"1138860":5,"1138960":5,"1138900":5,"1551790":5,"1552750":5,"1602710":5,"1554310":5,"1553170":5,"1557630":5,"1557110":5,"1144940":5,"1145310":5,"1559160":5,"1560670":5,"1585310":5,"1148640":5,"1324300":5,"1606560":5,"1519210":5,"2842390":5,"1311110":5,"1444610":5,"1444680":5,"1151260":5,"1013190":5,"1516930":5,"2394370":4,"2085080":4,"1151120":4,"1215230":4,"1284430":4,"1383260":4,"1352290":4,"1383310":4,"1015220":4,"1390800":4,"1526960":4,"1015840":4,"1542070":4,"1333550":4,"1333560":4,"1017330":4,"1929050":4,"1149830":4,"1323010":4,"1019280":4,"1019420":4,"1153890":4,"1153930":4,"1000590":4,"1154860":4,"1155060":4,"1155090":4,"1159810":4,"1378520":4,"1156530":4,"1382440":4,"1195140":4,"1155120":4,"1228650":4,"1421900":4,"1587290":4,"1576250":4,"1164010":4,"1165670":4,"1311450":4,"1155180":4,"1442750":4,"1222770":4,"1000940":4,"1357250":4,"1305700":4,"1588060":4,"1329590":4,"1451210":4,"1172400":4,"1457730":4,"1408810":4,"1486360":4,"1588320":4,"1158210":4,"1562850":4,"1310460":4,"1550190":4,"1588550":4,"1219510":4,"1001090":4,"1172830":4,"1172870":4,"1172910":4,"1028580":4,"1310530":4,"1588730":4,"1178450":4,"1001180":4,"1612770":4,"1032030":4,"1001640":4,"1190860":4,"1182620":4,"1182710":4,"1589030":4,"1402730":4,"1589040":4,"1223660":4,"1589060":4,"1445690":4,"1589110":4,"1002170":4,"1002400":4,"1548550":4,"1238840":4,"1496480":4,"1270550":4,"1576900":4,"1589260":4,"1546880":4,"1538440":4,"1238680":4,"1604135":4,"1001870":4,"1002500":4,"1309260":4,"1589350":4,"1217070":4,"1489340":4,"1365040":4,"1385910":4,"1270810":4,"1385920":4,"1589590":4,"1036290":4,"1201280":4,"1198360":4,"1198380":4,"1198660":4,"1198880":4,"1221250":4,"1510650":4,"1192700":4,"1238550":4,"1357210":4,"1193950":4,"1040060":4,"1040250":4,"1040260":4,"1257110":4,"1250220":4,"1511790":4,"1195840":4,"1346150":4,"1590480":4,"1192420":4,"1483190":4,"1487400":4,"2429350":4,"1242970":4,"1483150":4,"1509290":4,"1279680":4,"1477950":4,"1209240":4,"1432850":4,"1040380":4,"1483070":4,"1483090":4,"1209650":4,"1590770":4,"1510790":4,"1281020":4,"1215810":4,"1213870":4,"1214330":4,"1221520":4,"1220800":4,"1218560":4,"1591150":4,"1222700":4,"1225130":4,"1222840":4,"1223021":4,"1003430":4,"1258710":4,"1262530":4,"1222590":4,"1591420":4,"1247250":4,"1254180":4,"1591430":4,"1423240":4,"1226630":4,"1228560":4,"1228690":4,"1236950":4,"1237030":4,"1234140":4,"1238410":4,"1242350":4,"1592500":4,"1245470":4,"1245570":4,"1401910":4,"1184280":4,"1592270":4,"1173100":4,"1483540":4,"1269130":4,"1514960":4,"1247260":4,"1533820":4,"1252090":4,"1251270":4,"1251320":4,"1252390":4,"1047860":4,"1200220":4,"1250870":4,"1350080":4,"1185290":4,"1254130":4,"2853889":4,"1261190":4,"1257040":4,"1258520":4,"1258570":4,"1260000":4,"1307770":4,"1004310":4,"1282490":4,"1282260":4,"1278040":4,"1283500":4,"1283510":4,"1578700":4,"1279590":4,"1272280":4,"1282340":4,"1283860":4,"1274820":4,"1286400":4,"1360480":4,"1270390":4,"1267180":4,"1593570":4,"1449530":4,"1593590":4,"2524270":4,"1348530":4,"1004690":4,"1004710":4,"1295530":4,"1369900":4,"1593410":4,"1508750":4,"2217040":4,"1004790":4,"1593480":4,"1199890":4,"1199900":4,"1051970":4,"1289370":4,"1053350":4,"1289520":4,"1293780":4,"1293810":4,"1293990":4,"1297110":4,"1593670":4,"1184160":4,"1379750":4,"1184170":4,"1291270":4,"1005180":4,"1579720":4,"1293640":4,"1293650":4,"1057850":4,"1403040":4,"1357980":4,"1303770":4,"1058480":4,"1058580":4,"1304680":4,"1308090":4,"1315130":4,"1312420":4,"1594110":4,"1394730":4,"1312350":4,"1313850":4,"1421210":4,"1316300":4,"1185930":4,"1310260":4,"1594400":4,"1320140":4,"1595270":4,"1490670":4,"1304420":4,"1446760":4,"1308690":4,"1314400":4,"1322700":4,"1322920":4,"1323500":4,"1065680":4,"1318720":4,"1333090":4,"1334080":4,"1335440":4,"1335080":4,"1339460":4,"1340000":4,"1329000":4,"1341670":4,"1351430":4,"1347870":4,"1348430":4,"1349610":4,"1349480":4,"1347710":4,"1358490":4,"1358680":4,"1345250":4,"1420410":4,"1429060":4,"1367300":4,"1364670":4,"1365250":4,"1360930":4,"1362400":4,"1371320":4,"1371920":4,"1372800":4,"1372980":4,"1066680":4,"1066690":4,"1195970":4,"1586265":4,"1068550":4,"1374550":4,"1365980":4,"1006110":4,"1006140":4,"1070280":4,"1322320":4,"1070650":4,"1291500":4,"1397300":4,"1208640":4,"1246440":4,"1295070":4,"1567450":4,"1006280":4,"1378860":4,"1378990":4,"1375970":4,"1381100":4,"1373860":4,"1382250":4,"1386460":4,"1472800":4,"1374530":4,"1374300":4,"1391780":4,"1395620":4,"1390360":4,"1388410":4,"1006610":4,"1401210":4,"1160570":4,"1405890":4,"1396840":4,"1075500":4,"1396860":4,"1007000":4,"1007040":4,"1007060":4,"1345605":4,"1007130":4,"2008740":4,"1411300":4,"1413260":4,"1413940":4,"1414470":4,"1414580":4,"1075940":4,"1414920":4,"1596780":4,"1445790":4,"1007310":4,"1596930":4,"1404700":4,"1518070":4,"1369940":4,"1376600":4,"1356750":4,"1551530":4,"1257330":4,"1556370":4,"1416700":4,"1207250":4,"1207270":4,"1634500":4,"1157080":4,"1409110":4,"1404740":4,"1420160":4,"1419860":4,"1255060":4,"1077550":4,"1554820":4,"1007560":4,"1007660":4,"1426530":4,"1423650":4,"1426590":4,"1426920":4,"1421540":4,"1597780":4,"1255430":4,"1495740":4,"1433680":4,"1444980":4,"1441870":4,"1405790":4,"1405800":4,"1584060":4,"1294330":4,"1382980":4,"1434120":4,"1559290":4,"1427360":4,"1079290":4,"1437450":4,"1340460":4,"1328190":4,"1080000":4,"1328090":4,"1315240":4,"1441390":4,"1440670":4,"1438770":4,"1443660":4,"1443760":4,"1440660":4,"1621470":4,"1454180":4,"1449890":4,"1451490":4,"1177820":4,"1433030":4,"1454670":4,"1455280":4,"1349410":4,"1582200":4,"1454750":4,"1457210":4,"1474850":4,"1310670":4,"1326830":4,"1599340":4,"1009320":4,"1599390":4,"2846390":4,"1599400":4,"1599420":4,"1229840":4,"1529550":4,"1518540":4,"1447000":4,"1157090":4,"1532910":4,"1375620":4,"1375820":4,"1212670":4,"1599760":4,"1244310":4,"1599800":4,"1450330":4,"1463930":4,"1465720":4,"1465850":4,"1314600":4,"1367120":4,"1448440":4,"1444270":4,"1467620":4,"1600160":4,"1467710":4,"1467910":4,"1360320":4,"1529330":4,"1529390":4,"1304510":4,"1600280":4,"1600470":4,"1600530":4,"1546550":4,"1355810":4,"1100810":4,"1473230":4,"1472270":4,"1313080":4,"1172660":4,"1307550":4,"1355850":4,"1476430":4,"1421630":4,"1101570":4,"1477170":4,"1010150":4,"1194660":4,"1555440":4,"1501620":4,"1482340":4,"1480670":4,"1096770":4,"1463770":4,"1193610":4,"1106400":4,"1556630":4,"1272780":4,"1272820":4,"1601650":4,"1601660":4,"1601810":4,"1485520":4,"1227370":4,"1486460":4,"1484930":4,"1226360":4,"1169340":4,"1487660":4,"1602060":4,"1202440":4,"1106010":4,"1581710":4,"1426290":4,"1332570":4,"1108180":4,"1602440":4,"1362640":4,"1501350":4,"1500800":4,"1499460":4,"1497190":4,"1499230":4,"1408220":4,"1496890":4,"1602800":4,"1494860":4,"1450270":4,"1282770":4,"1116840":4,"1505120":4,"1505190":4,"1505600":4,"1509430":4,"1120010":4,"1510640":4,"1512220":4,"1520120":4,"1516750":4,"1517480":4,"1521400":4,"1376310":4,"1436510":4,"1522050":4,"1603550":4,"1523400":4,"1302070":4,"1497980":4,"1364360":4,"1387240":4,"1524990":4,"1215330":4,"1215260":4,"1604290":4,"1604300":4,"1526920":4,"1604350":4,"1259140":4,"1267280":4,"1527040":4,"1604550":4,"1604570":4,"1279990":4,"1604800":4,"1253190":4,"1382370":4,"1426680":4,"1404390":4,"1531190":4,"1530970":4,"1346370":4,"1431850":4,"1362950":4,"1363090":4,"2015610":4,"2607730":4,"1535780":4,"1293700":4,"1535880":4,"1534870":4,"1535910":4,"1362490":4,"1350600":4,"1538130":4,"1537980":4,"1350610":4,"1539040":4,"1605510":4,"1012800":4,"2772770":4,"1012810":4,"1310640":4,"1310680":4,"1605630":4,"1448580":4,"1538820":4,"1538870":4,"1309650":4,"1310050":4,"1529410":4,"1545710":4,"1546200":4,"1546220":4,"1546300":4,"1179005":4,"1543070":4,"1543240":4,"1543750":4,"1219680":4,"1218760":4,"1224880":4,"1550140":4,"1549660":4,"1554010":4,"1553130":4,"1552760":4,"1557290":4,"1558050":4,"1145130":4,"1145990":4,"1559900":4,"1148520":4,"1501660":4,"1606590":4,"1606680":4,"1538330":4,"1519230":4,"1351360":4,"1606810":4,"1208020":4,"2005990":4,"1150410":3,"1150860":3,"1284930":3,"1013980":3,"1150450":3,"1401000":3,"1379210":3,"1014590":3,"1014680":3,"1586210":3,"1609010":3,"1532310":3,"1436730":3,"1586250":3,"1152730":3,"1152510":3,"1544990":3,"1213060":3,"1544730":3,"1512080":3,"1448810":3,"1612620":3,"1153440":3,"1609050":3,"1448860":3,"1383680":3,"1254480":3,"1538590":3,"1271290":3,"1586730":3,"1549340":3,"1361510":3,"1586780":3,"1263490":3,"1610550":3,"1263510":3,"1586820":3,"1586840":3,"1586850":3,"1019450":3,"1517510":3,"1284480":3,"1150110":3,"1154770":3,"1586910":3,"1154120":3,"1981450":3,"1158500":3,"1156100":3,"1156410":3,"1578790":3,"1404320":3,"1375040":3,"1378590":3,"1000730":3,"1159930":3,"1156610":3,"1156560":3,"1158450":3,"1156640":3,"1157760":3,"1390780":3,"1566210":3,"1155150":3,"1481350":3,"1155920":3,"1584090":3,"1151580":3,"1410800":3,"1587300":3,"1311870":3,"1308080":3,"1587310":3,"1576100":3,"1609210":3,"1308300":3,"1188790":3,"1575940":3,"1163170":3,"1163340":3,"1576200":3,"1164340":3,"1164510":3,"1164740":3,"1577130":3,"1165790":3,"1166510":3,"1188880":3,"1158400":3,"1335290":3,"1167820":3,"1231890":3,"1531940":3,"1158950":3,"1158810":3,"1231720":3,"1288940":3,"1288950":3,"2857380":3,"1155210":3,"1155710":3,"1587700":3,"1000920":3,"1160140":3,"1217270":3,"1337370":3,"1337390":3,"1264380":3,"1343150":3,"1022210":3,"1168190":3,"1168390":3,"1169610":3,"1169660":3,"1025140":3,"1352140":3,"1577660":3,"1329650":3,"1451170":3,"1443970":3,"1231490":3,"1319750":3,"1225510":3,"1171300":3,"1253570":3,"1158160":3,"1397720":3,"1565300":3,"1416340":3,"1471560":3,"1609350":3,"1473460":3,"1550380":3,"1473960":3,"1172590":3,"1172610":3,"1508290":3,"1174070":3,"1576520":3,"1173660":3,"1173430":3,"1174760":3,"1173990":3,"1351400":3,"1583460":3,"1173340":3,"1029430":3,"1588760":3,"1454500":3,"1175570":3,"1176430":3,"1176820":3,"1176660":3,"1030950":3,"1176960":3,"1607520":3,"2826528":3,"1643510":3,"1588810":3,"1629200":3,"1432410":3,"1181700":3,"1181500":3,"1179830":3,"1180900":3,"1332760":3,"1412880":3,"1588840":3,"1032390":3,"1413140":3,"1588920":3,"1182500":3,"1179320":3,"1403550":3,"1223680":3,"1545110":3,"1589090":3,"1002450":3,"1179040":3,"1236650":3,"1589200":3,"1236690":3,"1979930":3,"1183590":3,"1420020":3,"1558400":3,"1224190":3,"1410410":3,"1660100":3,"1034660":3,"1437560":3,"1002290":3,"1270700":3,"1535140":3,"1589340":3,"1324990":3,"1309460":3,"1001560":3,"1613570":3,"1523450":3,"1228180":3,"1577985":3,"1589580":3,"2859161":3,"1183090":3,"1183480":3,"1183510":3,"1190710":3,"1195710":3,"1036170":3,"1036400":3,"1198170":3,"1199330":3,"1204330":3,"1198230":3,"1202300":3,"1201260":3,"1198430":3,"1198960":3,"1198530":3,"1203540":3,"1202760":3,"1199010":3,"1203800":3,"1200960":3,"1200120":3,"1199720":3,"1312970":3,"1589780":3,"1589820":3,"1197120":3,"1516310":3,"1189500":3,"1186760":3,"1224020":3,"1589840":3,"1609500":3,"1264640":3,"1191870":3,"1955900":3,"1207500":3,"1206080":3,"1205830":3,"1206800":3,"1206820":3,"1170650":3,"1205200":3,"1205900":3,"1207130":3,"1170660":3,"1590145":3,"1590150":3,"1253920":3,"1190080":3,"1196030":3,"1590200":3,"1155980":3,"1193880":3,"1411110":3,"1195670":3,"1191980":3,"1260260":3,"1193290":3,"1580820":3,"1194450":3,"1372900":3,"1250090":3,"1258950":3,"1584100":3,"1446420":3,"1270990":3,"1609560":3,"1189600":3,"1003170":3,"1208270":3,"1206650":3,"1208360":3,"1208460":3,"1483200":3,"1487410":3,"1590560":3,"1242590":3,"1191060":3,"1208920":3,"1484330":3,"1196970":3,"1352150":3,"1364440":3,"1585060":3,"1477960":3,"1590600":3,"1002970":3,"1194280":3,"1245280":3,"1508300":3,"1209540":3,"1483800":3,"1483805":3,"1590740":3,"1190740":3,"1214540":3,"1210590":3,"1281000":3,"1212330":3,"1214810":3,"1213280":3,"1212960":3,"1214840":3,"1214900":3,"1212250":3,"1212380":3,"1212210":3,"1210750":3,"1212410":3,"1212260":3,"1212450":3,"1215870":3,"1215790":3,"1211490":3,"1211510":3,"1212570":3,"1213720":3,"1214200":3,"1211630":3,"1216060":3,"1226020":3,"1223150":3,"1221950":3,"1220810":3,"1226040":3,"1220550":3,"1220870":3,"1218190":3,"1591100":3,"1220930":3,"1222170":3,"1217040":3,"1379330":3,"1223240":3,"1225110":3,"1223250":3,"1580260":3,"1220570":3,"1221430":3,"1223520":3,"1226140":3,"1003400":3,"1003450":3,"1591330":3,"1221740":3,"1223330":3,"1223340":3,"1221130":3,"1221770":3,"1591400":3,"1219910":3,"1219190":3,"1609660":3,"1222640":3,"1219490":3,"1225900":3,"1225630":3,"1226960":3,"1041850":3,"1042200":3,"1230380":3,"1919590":3,"1229880":3,"1227610":3,"1227720":3,"1228680":3,"1228330":3,"1229200":3,"1228890":3,"2269050":3,"1230360":3,"1218960":3,"1237020":3,"1234080":3,"1281890":3,"1233630":3,"1237130":3,"1237160":3,"1236470":3,"1234700":3,"1591660":3,"1236750":3,"1591720":3,"1236600":3,"1232880":3,"1239560":3,"1232180":3,"1257250":3,"1531110":3,"1384840":3,"1384860":3,"1223440":3,"1226160":3,"1242600":3,"1595090":3,"1241490":3,"1242700":3,"1242850":3,"1241550":3,"1243020":3,"1243040":3,"1242420":3,"1241880":3,"1241810":3,"1243290":3,"1243310":3,"1243940":3,"1592100":3,"1246270":3,"1333150":3,"1291730":3,"1497800":3,"1509350":3,"1577650":3,"1245020":3,"1184370":3,"1244560":3,"1004060":3,"1244250":3,"1397450":3,"1397620":3,"1397590":3,"1155400":3,"1514930":3,"1044020":3,"1514940":3,"1046430":3,"1046840":3,"1044480":3,"1247030":3,"1044830":3,"1237510":3,"1047300":3,"1244320":3,"1244350":3,"1514950":3,"1244680":3,"1189960":3,"1351730":3,"1189980":3,"1956150":3,"1247660":3,"1248710":3,"1247470":3,"2080200":3,"1252050":3,"1250720":3,"1251130":3,"1250830":3,"1249470":3,"1252360":3,"1252140":3,"1250620":3,"1249660":3,"1253060":3,"1250190":3,"1251670":3,"1047880":3,"1048400":3,"1253310":3,"1253410":3,"1577040":3,"2234080":3,"1254690":3,"1253950":3,"1254730":3,"1254340":3,"1254020":3,"1254380":3,"1254050":3,"1255880":3,"1255020":3,"1177180":3,"1256730":3,"1258810":3,"2078590":3,"1259390":3,"1264650":3,"1263550":3,"1264420":3,"1256170":3,"1257890":3,"1263650":3,"1263710":3,"1263750":3,"1263770":3,"1257420":3,"1263810":3,"1257500":3,"1259930":3,"1258000":3,"1263760":3,"1257590":3,"1258200":3,"2147630":3,"1270910":3,"1558670":3,"1469890":3,"1558920":3,"1592930":3,"1282240":3,"1275130":3,"1280530":3,"1283300":3,"1285520":3,"1284600":3,"1271750":3,"1281270":3,"1272950":3,"1284740":3,"1279170":3,"1282410":3,"1278510":3,"1271990":3,"1269720":3,"1279730":3,"1283700":3,"1282100":3,"1236500":3,"1278400":3,"1274640":3,"1272730":3,"1281170":3,"1593070":3,"1048910":3,"1049010":3,"1488840":3,"1593100":3,"1054230":3,"1271310":3,"1271010":3,"1266470":3,"2853884":3,"1240180":3,"1286370":3,"1288080":3,"1285790":3,"1287070":3,"1287280":3,"1288340":3,"1264770":3,"1175300":3,"1286170":3,"1286240":3,"1286320":3,"1288640":3,"1593290":3,"1313580":3,"1157510":3,"1264600":3,"1419570":3,"1504770":3,"1277500":3,"1277520":3,"1348630":3,"1270680":3,"1347830":3,"1004830":3,"1579080":3,"1299030":3,"1582130":3,"1289070":3,"1289140":3,"1290390":3,"1004890":3,"1289620":3,"1289400":3,"1289710":3,"1290560":3,"1291070":3,"1055000":3,"1296300":3,"1293850":3,"1296820":3,"1293940":3,"1579210":3,"1294220":3,"1294630":3,"1296120":3,"1296670":3,"1278380":3,"1056230":3,"1235950":3,"1226990":3,"1379640":3,"1297540":3,"1298200":3,"1297910":3,"1297950":3,"1593710":3,"1329010":3,"1235910":3,"1583260":3,"1310090":3,"1309670":3,"1291880":3,"1541900":3,"1298960":3,"1297510":3,"1297650":3,"1005390":3,"1005210":3,"1585460":3,"1593800":3,"1291410":3,"1297980":3,"1593830":3,"1206060":3,"1206070":3,"1290810":3,"1299680":3,"1279310":3,"1231650":3,"1177390":3,"1403020":3,"1302090":3,"1302280":3,"1304200":3,"1304350":3,"2101130":3,"1929950":3,"1594060":3,"1064120":3,"1064250":3,"1430690":3,"1506050":3,"1319580":3,"1319060":3,"1581790":3,"1316040":3,"1310130":3,"1005480":3,"1594190":3,"1312720":3,"1313830":3,"1316220":3,"1317770":3,"1313960":3,"1310180":3,"1314010":3,"1312220":3,"1318000":3,"1431670":3,"1318090":3,"1309560":3,"1387010":3,"1316680":3,"1595240":3,"1335210":3,"1335230":3,"1365050":3,"1320640":3,"1319860":3,"1320970":3,"1321020":3,"1321040":3,"1321110":3,"1321140":3,"1005870":3,"2820720":3,"1320830":3,"1320170":3,"1310230":3,"1309950":3,"1318340":3,"1583470":3,"1310270":3,"1321630":3,"2179090":3,"1321650":3,"1594480":3,"1310300":3,"1310950":3,"1312780":3,"1594530":3,"1579490":3,"1305380":3,"1005600":3,"1318680":3,"1314270":3,"1317110":3,"1389460":3,"2080210":3,"1402930":3,"1323940":3,"1427510":3,"1333450":3,"1331840":3,"1337000":3,"1331030":3,"1330510":3,"1333500":3,"1331400":3,"1336260":3,"1331670":3,"1065950":3,"1332130":3,"1335570":3,"1336500":3,"1334150":3,"1333730":3,"1333750":3,"1330790":3,"1334210":3,"1336820":3,"1332400":3,"1325260":3,"1337300":3,"1327790":3,"1329300":3,"1328110":3,"1325910":3,"1339260":3,"1340030":3,"1329340":3,"1326160":3,"1326320":3,"1330450":3,"1328890":3,"1342220":3,"1341210":3,"1342380":3,"1342390":3,"1306200":3,"2083540":3,"1351270":3,"1351910":3,"1352170":3,"1352060":3,"1347530":3,"1580490":3,"1352980":3,"1356700":3,"1356510":3,"1377080":3,"1377590":3,"1356000":3,"1580290":3,"1594930":3,"1351030":3,"1378650":3,"1356730":3,"1353850":3,"1355540":3,"1354030":3,"1351560":3,"1580270":3,"1349520":3,"1349170":3,"1347200":3,"1350290":3,"1347310":3,"1350340":3,"1356370":3,"1351680":3,"1345020":3,"1357480":3,"1357510":3,"1358530":3,"1358600":3,"1357300":3,"1358620":3,"1358660":3,"1358670":3,"1358690":3,"1344030":3,"1345140":3,"1344650":3,"1595480":3,"1343640":3,"1344150":3,"1345430":3,"1342510":3,"1344200":3,"1420400":3,"1358760":3,"1168060":3,"1355710":3,"1366010":3,"1364520":3,"1363650":3,"1359150":3,"1359240":3,"1367380":3,"1362730":3,"1365460":3,"1368020":3,"1359040":3,"1368370":3,"1365230":3,"1362100":3,"1360770":3,"2830705":3,"1365770":3,"1361110":3,"1360410":3,"1369070":3,"1366190":3,"1365410":3,"1359620":3,"1359730":3,"1361000":3,"1369530":3,"1400390":3,"1370320":3,"1371610":3,"1371170":3,"1067210":3,"1372370":3,"1580825":3,"1373060":3,"1067040":3,"1525250":3,"1307710":3,"1067770":3,"1229060":3,"1539080":3,"1068770":3,"1348900":3,"1196000":3,"1241750":3,"1365990":3,"1595680":3,"1069210":3,"1069520":3,"1069930":3,"1450890":3,"1006380":3,"1397350":3,"1220310":3,"1404100":3,"1072260":3,"1595730":3,"1295040":3,"1295060":3,"1174890":3,"1472650":3,"1376590":3,"2088240":3,"1375260":3,"1610040":3,"2081570":3,"1375290":3,"1376760":3,"1373990":3,"1381320":3,"1382100":3,"1378200":3,"1374700":3,"1375690":3,"1377290":3,"1379950":3,"1375740":3,"1596050":3,"1375760":3,"1380690":3,"1573150":3,"1375790":3,"1374880":3,"1381750":3,"1380760":3,"1376070":3,"1379430":3,"1379530":3,"1376250":3,"1204300":3,"1382700":3,"1383180":3,"1382830":3,"1373970":3,"1386370":3,"1383030":3,"1386020":3,"1386840":3,"1074600":3,"1386070":3,"1386990":3,"1386350":3,"1383160":3,"1394250":3,"1394770":3,"1394840":3,"1389780":3,"1581180":3,"1388300":3,"1393090":3,"1392250":3,"1393350":3,"1075040":3,"1395660":3,"1392290":3,"2137720":3,"1351830":3,"1403060":3,"1403160":3,"1400050":3,"1399610":3,"1401090":3,"1402360":3,"1401240":3,"1405050":3,"1436050":3,"1406090":3,"1397630":3,"1581730":3,"1160540":3,"1006790":3,"1006810":3,"1406000":3,"1244960":3,"1006930":3,"1406030":3,"1075480":3,"1397100":3,"1596690":3,"1406060":3,"2396190":3,"1007010":3,"1406660":3,"1406710":3,"1406400":3,"1406150":3,"1406460":3,"1442730":3,"1949190":3,"1409800":3,"2082450":3,"1412560":3,"1415470":3,"1409200":3,"1409250":3,"1413180":3,"1413330":3,"1411790":3,"1596750":3,"1410930":3,"1413880":3,"1412960":3,"1410120":3,"1414160":3,"1610160":3,"1414360":3,"1410780":3,"1414650":3,"1414790":3,"1412170":3,"1414850":3,"1075960":3,"1411470":3,"1076860":3,"1408370":3,"1506930":3,"1412400":3,"1415150":3,"1445770":3,"1076170":3,"2055530":3,"1268770":3,"1516160":3,"1415750":3,"1007370":3,"1205780":3,"1407810":3,"1344410":3,"1538900":3,"1596950":3,"1596960":3,"1416170":3,"1430670":3,"1551370":3,"1551710":3,"1251100":3,"1416230":3,"1007230":3,"2643970":3,"1007240":3,"1597120":3,"1581590":3,"1581400":3,"1328820":3,"1404450":3,"1445150":3,"1553120":3,"1597160":3,"1240530":3,"2068840":3,"1597180":3,"1211340":3,"1534930":3,"1312250":3,"1312260":3,"1512410":3,"1597200":3,"1633690":3,"1417040":3,"1417330":3,"1420070":3,"1417550":3,"1419080":3,"1077250":3,"1419270":3,"1418160":3,"1417020":3,"1417030":3,"1420730":3,"1420780":3,"1420800":3,"1077330":3,"1077360":3,"1420530":3,"1420840":3,"1158870":3,"1610740":3,"1242300":3,"1420970":3,"1421020":3,"1422050":3,"1420580":3,"1420590":3,"1497680":3,"1420680":3,"1421440":3,"1421450":3,"1422570":3,"1078040":3,"1007720":3,"1620400":3,"1426520":3,"1423430":3,"1423640":3,"1424150":3,"1424410":3,"1426910":3,"1602330":3,"1424550":3,"1426670":3,"1426650":3,"1429850":3,"1429120":3,"1429170":3,"1430220":3,"1430230":3,"1427170":3,"1431110":3,"1427110":3,"1372630":3,"1433070":3,"1433090":3,"1433180":3,"1432880":3,"1433330":3,"1514110":3,"1433650":3,"1483730":3,"1495640":3,"1597850":3,"1331530":3,"2145240":3,"1445270":3,"1894690":3,"1515340":3,"1240810":3,"1251900":3,"1355970":3,"1547530":3,"1610430":3,"1296680":3,"1226510":3,"1382990":3,"1582960":3,"1365860":3,"1434040":3,"1559260":3,"1896380":3,"1338400":3,"1598530":3,"1436320":3,"1435490":3,"1436260":3,"1436410":3,"1436540":3,"1435080":3,"1081430":3,"1582000":3,"1340570":3,"1437340":3,"1437430":3,"1437440":3,"1437500":3,"2825960":3,"1328310":3,"1008430":3,"1437780":3,"1437610":3,"1328170":3,"1437670":3,"1437960":3,"1437700":3,"1327410":3,"1084000":3,"1438080":3,"1438970":3,"1443320":3,"1081040":3,"1442260":3,"1439580":3,"1445160":3,"1535930":3,"1445980":3,"1446740":3,"2252690":3,"1449550":3,"1451900":3,"1632200":3,"1449090":3,"1451380":3,"1452500":3,"1466950":3,"1449870":3,"1454240":3,"1447320":3,"1453550":3,"1453580":3,"1454290":3,"1432900":3,"1432920":3,"1432980":3,"1444970":3,"1315840":3,"1198890":3,"1455500":3,"1454510":3,"1456420":3,"1455850":3,"1455170":3,"1456010":3,"1456040":3,"1198910":3,"1189000":3,"1008570":3,"1343110":3,"1444780":3,"1444990":3,"1582870":3,"1370410":3,"1598750":3,"1508550":3,"1610870":3,"1445470":3,"1457040":3,"1085030":3,"1457200":3,"1443990":3,"1485230":3,"1485350":3,"1539980":3,"1234260":3,"1445580":3,"1267610":3,"1088580":3,"1085760":3,"1088830":3,"1086410":3,"1326800":3,"1445130":3,"1089280":3,"1326990":3,"1436900":3,"1457320":3,"1008790":3,"1009330":3,"1009340":3,"1087630":3,"1531330":3,"1459400":3,"1430580":3,"1425710":3,"1552120":3,"1478780":3,"1425790":3,"1610960":3,"1428830":3,"1552130":3,"1552140":3,"1529560":3,"1009410":3,"1459690":3,"1470080":3,"1188270":3,"1188490":3,"1459720":3,"1378450":3,"1410660":3,"1470970":3,"1555930":3,"1469870":3,"1459830":3,"1611020":3,"1611030":3,"1188420":3,"1314680":3,"1244470":3,"1152720":3,"2083100":3,"1464180":3,"1464880":3,"1464030":3,"1464250":3,"1632320":3,"1582710":3,"1466360":3,"1367010":3,"1366770":3,"1478190":3,"1478200":3,"1496840":3,"2836242":3,"1290020":3,"1217900":3,"1217950":3,"1397840":3,"1467930":3,"1467950":3,"1468380":3,"1469000":3,"1468950":3,"1600240":3,"1537250":3,"1470120":3,"1470620":3,"1470660":3,"1470770":3,"1470370":3,"2080530":3,"1260330":3,"1600260":3,"1304480":3,"1600270":3,"1345640":3,"1519620":3,"1519630":3,"1269330":3,"1093920":3,"1600290":3,"1358870":3,"1340820":3,"1010050":3,"1355790":3,"2069620":3,"1100610":3,"1201860":3,"1097740":3,"1095040":3,"1473140":3,"1101120":3,"1471970":3,"1101260":3,"1514840":3,"1601260":3,"1474620":3,"1600650":3,"2646460":3,"1474820":3,"1476060":3,"1475910":3,"1474720":3,"1600720":3,"1573820":3,"1471330":3,"1581610":3,"1611200":3,"1101440":3,"1203270":3,"1101510":3,"1220240":3,"1476450":3,"1547600":3,"1476520":3,"1451040":3,"1099100":3,"1477310":3,"1477390":3,"1477500":3,"1478080":3,"1477680":3,"1632430":3,"1477720":3,"1477840":3,"1477910":3,"1562310":3,"1550830":3,"1516460":3,"1550840":3,"1171680":3,"1500880":3,"1515120":3,"1351040":3,"1355910":3,"1501110":3,"1261140":3,"1366210":3,"2022640":3,"1100090":3,"1481890":3,"1480380":3,"1481590":3,"1096560":3,"1478620":3,"1481630":3,"1481800":3,"1582290":3,"2796520":3,"1484350":3,"1483560":3,"1612920":3,"1106530":3,"1483280":3,"1485450":3,"1487320":3,"1484920":3,"1486530":3,"1207510":3,"1464340":3,"1601890":3,"1010900":3,"1601900":3,"1482990":3,"1105360":3,"1575990":3,"1367680":3,"1449330":3,"1612530":3,"1483420":3,"1483440":3,"1484150":3,"1486170":3,"1487970":3,"1484620":3,"1489350":3,"1490430":3,"1490010":3,"1489510":3,"1489700":3,"1507670":3,"1490070":3,"1489880":3,"1602360":3,"2648780":3,"1491120":3,"1512360":3,"1107060":3,"1922780":3,"2423740":3,"1502850":3,"1491150":3,"1499830":3,"1583640":3,"1437310":3,"1491370":3,"1498460":3,"1500970":3,"1216880":3,"1411070":3,"1492350":3,"1386160":3,"1530030":3,"1492570":3,"1492680":3,"1496540":3,"1496670":3,"1493370":3,"1520190":3,"1493700":3,"1499150":3,"1398750":3,"1292300":3,"1497180":3,"1177500":3,"1408815":3,"1502430":3,"1502560":3,"1502790":3,"1487770":3,"1493240":3,"1499490":3,"1494790":3,"1494970":3,"1115630":3,"1115900":3,"1495220":3,"1361330":3,"1366310":3,"1114640":3,"1357990":3,"1117030":3,"1502860":3,"1505090":3,"1505070":3,"1503870":3,"1505650":3,"1504330":3,"1506870":3,"1583870":3,"1508070":3,"1509480":3,"1263110":3,"1263120":3,"1120070":3,"1510890":3,"1121390":3,"1511040":3,"1120280":3,"1513060":3,"1517150":3,"1519750":3,"1519830":3,"1516990":3,"1515670":3,"1516220":3,"1518180":3,"1517090":3,"1584105":3,"1518120":3,"1603420":3,"1123230":3,"1123440":3,"1121740":3,"1123550":3,"1267740":3,"1565750":3,"1603500":3,"1513940":3,"1514420":3,"1501760":3,"1288550":3,"1177070":3,"1584160":3,"1551940":3,"1486030":3,"1522060":3,"1522750":3,"1523180":3,"1011920":3,"1215240":3,"1012050":3,"1126190":3,"1126590":3,"1532750":3,"1467150":3,"1524750":3,"1497960":3,"1406230":3,"1363540":3,"1376640":3,"1403120":3,"1490740":3,"1127970":3,"1603950":3,"1215320":3,"1349860":3,"1363250":3,"1394800":3,"1604130":3,"1206530":3,"1363740":3,"1349590":3,"1129240":3,"1450030":3,"1327120":3,"1216250":3,"1216280":3,"1199350":3,"2800530":3,"1525780":3,"1526860":3,"1365520":3,"1320810":3,"1259820":3,"1527070":3,"1259620":3,"1130650":3,"1604540":3,"2014380":3,"1467530":3,"1604690":3,"1445360":3,"1444950":3,"1528490":3,"1528060":3,"1528150":3,"1131990":3,"1956960":3,"1604750":3,"1253180":3,"1277080":3,"1277100":3,"1530020":3,"1604850":3,"1604870":3,"1254670":3,"1530510":3,"1529500":3,"1237820":3,"1531040":3,"1197710":3,"1532410":3,"1531950":3,"1531680":3,"1532160":3,"1532800":3,"1482010":3,"1612000":3,"1133830":3,"1584695":3,"1533330":3,"1533130":3,"1533550":3,"1134370":3,"1362890":3,"1363050":3,"1533950":3,"1469570":3,"1535560":3,"1535650":3,"1534880":3,"1505390":3,"1612050":3,"1315610":3,"1546210":3,"1535810":3,"2219590":3,"1260670":3,"1535850":3,"1605270":3,"1229350":3,"1322990":3,"1502420":3,"1502480":3,"1502550":3,"1533720":3,"1505260":3,"1012730":3,"1537970":3,"1538100":3,"2057030":3,"1538000":3,"1192270":3,"1537820":3,"1337190":3,"1605570":3,"1182700":3,"1471200":3,"1318950":3,"2771700":3,"1538920":3,"1539740":3,"1541290":3,"1539230":3,"1539280":3,"1540130":3,"1540150":3,"1541570":3,"1605680":3,"2863051":3,"1136850":3,"1605720":3,"1349380":3,"1538560":3,"1357030":3,"1518130":3,"1232870":3,"1537150":3,"1605840":3,"1372650":3,"1545350":3,"1546990":3,"1546680":3,"1546310":3,"1545820":3,"1546620":3,"1546800":3,"1546820":3,"1545770":3,"1137570":3,"1542920":3,"1180860":3,"1543000":3,"1310600":3,"1543200":3,"1137620":3,"1536930":3,"1373850":3,"1544520":3,"1543630":3,"1543660":3,"1456130":3,"1191680":3,"1544590":3,"1168660":3,"1606140":3,"1224890":3,"1547710":3,"1137880":3,"1207230":3,"1138710":3,"1549470":3,"1549910":3,"1550980":3,"1549550":3,"1550880":3,"1550020":3,"1551200":3,"1552740":3,"1585110":3,"1554640":3,"1553820":3,"1554280":3,"1585230":3,"1557450":3,"1557470":3,"1557050":3,"1558330":3,"1558370":3,"1559600":3,"1559610":3,"1561090":3,"1606450":3,"1147220":3,"1561620":3,"1561760":3,"1561840":3,"1555710":3,"1148850":3,"1197020":3,"1509490":3,"1562530":3,"1503000":3,"1410760":3,"1240750":3,"1533340":3,"1562400":3,"1351280":3,"1208000":3,"1575730":3,"1607050":3,"1562800":3,"1401310":2,"1014210":2,"1567920":2,"1609000":2,"1381760":2,"1515580":2,"1015310":2,"1254010":2,"1518320":2,"1532300":2,"2864817":2,"2864818":2,"1453810":2,"1581330":2,"1527010":2,"1544970":2,"1586430":2,"1586440":2,"1448800":2,"1275330":2,"1153080":2,"1586520":2,"1448930":2,"1586530":2,"1519340":2,"1311750":2,"1568910":2,"1167610":2,"1171970":2,"1213470":2,"1543910":2,"1586670":2,"1511950":2,"1218360":2,"1586700":2,"1281450":2,"1396910":2,"1396970":2,"1400620":2,"1200740":2,"1200750":2,"1427080":2,"1541560":2,"1612650":2,"1278810":2,"1278830":2,"1153720":2,"1154820":2,"1020410":2,"1264080":2,"1264230":2,"1156520":2,"1609130":2,"1282000":2,"1160630":2,"1220060":2,"1587180":2,"1155100":2,"1155110":2,"1021220":2,"1539660":2,"1158780":2,"1156740":2,"1587320":2,"1161170":2,"1164690":2,"1167270":2,"1585390":2,"1164040":2,"1164650":2,"1164950":2,"2088750":2,"2149180":2,"1188850":2,"1158390":2,"1160330":2,"1158490":2,"1335310":2,"1156320":2,"1609260":2,"1587670":2,"1391500":2,"1587840":2,"2856157":2,"1023100":2,"1169720":2,"1024950":2,"1025010":2,"1025690":2,"1587970":2,"1224080":2,"1497430":2,"1497360":2,"1497420":2,"1349440":2,"1329770":2,"1329640":2,"1475530":2,"1475500":2,"1588140":2,"1609310":2,"1478010":2,"1001010":2,"1588330":2,"1321820":2,"1173710":2,"1574470":2,"1541610":2,"1524500":2,"1250700":2,"1550630":2,"1550270":2,"1389430":2,"1289740":2,"1289780":2,"1391940":2,"1391950":2,"1588500":2,"1473870":2,"1473880":2,"1588590":2,"1001060":2,"1172710":2,"2007420":2,"1174620":2,"1174720":2,"1001150":2,"1175030":2,"1028990":2,"1202290":2,"1029760":2,"1155780":2,"1176320":2,"1176260":2,"1176860":2,"1175860":2,"1178260":2,"1176510":2,"1177320":2,"1608720":2,"1432280":2,"1033900":2,"1179840":2,"1181560":2,"1609380":2,"1179930":2,"1179980":2,"1179760":2,"1609390":2,"1180060":2,"1031610":2,"1412950":2,"1414570":2,"1032180":2,"1032880":2,"1415050":2,"1612780":2,"2411600":2,"1270220":2,"1588930":2,"1472230":2,"1612800":2,"1514460":2,"2167510":2,"1182680":2,"1402640":2,"2847540":2,"1410710":2,"1589080":2,"1002280":2,"1316830":2,"1382280":2,"1002030":2,"1002770":2,"1002050":2,"1236940":2,"1002390":2,"1589220":2,"1693840":2,"1338475":2,"1002110":2,"1578070":2,"1589250":2,"1414190":2,"1238650":2,"1001720":2,"2826190":2,"1612820":2,"1001950":2,"2149640":2,"1002360":2,"1647360":2,"1610630":2,"1309230":2,"1309310":2,"1589330":2,"1335780":2,"1612680":2,"1589430":2,"1365190":2,"1035780":2,"1183050":2,"1183140":2,"1183390":2,"1183450":2,"1183470":2,"1270530":2,"1344980":2,"1196540":2,"1036560":2,"1203100":2,"1202560":2,"1589660":2,"1200840":2,"1199000":2,"1201520":2,"1199510":2,"1199520":2,"1200930":2,"1200060":2,"1199080":2,"1201000":2,"1202850":2,"1199640":2,"1199160":2,"1199680":2,"1204070":2,"1199250":2,"1202950":2,"1201790":2,"1204520":2,"1221240":2,"1226610":2,"1512150":2,"1191780":2,"1589880":2,"1589960":2,"1589970":2,"1204800":2,"1399970":2,"1565480":2,"1193130":2,"1205010":2,"1205190":2,"1206870":2,"1205100":2,"1205220":2,"1206190":2,"1207030":2,"1207080":2,"1205490":2,"1205950":2,"1207180":2,"1590080":2,"1190810":2,"1193860":2,"1184940":2,"1335800":2,"1335830":2,"1357160":2,"1193910":2,"1002790":2,"1590240":2,"1196120":2,"1192940":2,"1609530":2,"1411170":2,"1590250":2,"1196170":2,"1610640":2,"1195790":2,"1185640":2,"1037400":2,"1190370":2,"1190390":2,"1511600":2,"1511770":2,"1590410":2,"1266550":2,"1511760":2,"1578210":2,"1590420":2,"1206590":2,"1206610":2,"1207340":2,"1206680":2,"1418140":2,"1208240":2,"1208300":2,"1208450":2,"1208480":2,"1187870":2,"1196270":2,"1195850":2,"1590540":2,"1188100":2,"1352030":2,"1190470":2,"1256520":2,"1037960":2,"1196380":2,"1484320":2,"1209080":2,"1609610":2,"1364920":2,"1435180":2,"1040350":2,"1195890":2,"1569570":2,"1193450":2,"1205740":2,"1038500":2,"1567650":2,"1245380":2,"1590710":2,"1267220":2,"1039300":2,"1190730":2,"1209630":2,"1208520":2,"1157330":2,"1209580":2,"1590820":2,"1215380":2,"1212780":2,"1212360":2,"1215910":2,"1215200":2,"1609650":2,"1215520":2,"1209920":2,"1212480":2,"1214980":2,"1210460":2,"1211730":2,"1210620":2,"1214560":2,"1210100":2,"1216010":2,"1215010":2,"1590950":2,"1213990":2,"1214030":2,"1577620":2,"1213260":2,"1221880":2,"1423160":2,"1220880":2,"1591080":2,"1218920":2,"1220560":2,"1223210":2,"1285890":2,"1224700":2,"1591210":2,"1223820":2,"1422990":2,"1219060":2,"1222460":2,"1219110":2,"1591290":2,"1003590":2,"1219170":2,"1226760":2,"1226710":2,"1043150":2,"1042150":2,"1227700":2,"1227780":2,"1227940":2,"1230350":2,"1228100":2,"1378140":2,"1236200":2,"1235960":2,"1281930":2,"1236740":2,"1237370":2,"1282220":2,"1232990":2,"1239970":2,"1223120":2,"1304400":2,"1591990":2,"1242750":2,"1244090":2,"1246250":2,"1245730":2,"1245790":2,"1043310":2,"1436840":2,"1592130":2,"1246490":2,"1003710":2,"1244520":2,"1244530":2,"1246510":2,"1516260":2,"1538250":2,"1516270":2,"1295170":2,"1295190":2,"1003810":2,"1184360":2,"1184450":2,"1359940":2,"1276110":2,"1003860":2,"1003870":2,"1572760":2,"1244050":2,"1472990":2,"1278220":2,"1244230":2,"1592290":2,"1397580":2,"1229610":2,"1324210":2,"1592350":2,"1200450":2,"1044440":2,"2831360":2,"1269140":2,"1609730":2,"1249230":2,"1250990":2,"1250750":2,"1592540":2,"1250310":2,"1251810":2,"1533860":2,"1251630":2,"1251030":2,"1253130":2,"1234210":2,"1252490":2,"1250430":2,"1250450":2,"1203380":2,"1533930":2,"1253690":2,"1185170":2,"1185330":2,"1185510":2,"1298090":2,"1253800":2,"1185780":2,"1255110":2,"1255120":2,"1255560":2,"1253840":2,"1255840":2,"1222510":2,"1186230":2,"1177190":2,"1333400":2,"1260530":2,"1259440":2,"1260190":2,"1261340":2,"1261470":2,"1261500":2,"1258660":2,"1262660":2,"1260240":2,"1258880":2,"1264690":2,"1263500":2,"1260660":2,"1262460":2,"1262490":2,"1270870":2,"1558760":2,"1592920":2,"1277980":2,"1236170":2,"1273420":2,"1283400":2,"1273510":2,"1278090":2,"1277880":2,"1271970":2,"1282280":2,"1278130":2,"1273820":2,"1276220":2,"2008040":2,"1279540":2,"1273900":2,"1283060":2,"1274120":2,"1275070":2,"1273030":2,"1283690":2,"1279790":2,"1592990":2,"1280990":2,"1272320":2,"1279600":2,"1281180":2,"1283830":2,"1283850":2,"1285140":2,"1270010":2,"1274550":2,"1282650":2,"1274810":2,"1283000":2,"1578780":2,"1285330":2,"1272580":2,"1285390":2,"1275250":2,"1048830":2,"1049340":2,"1350710":2,"1286160":2,"1286780":2,"1287180":2,"1005030":2,"1350730":2,"1446180":2,"1360890":2,"1360920":2,"1288370":2,"1288350":2,"1268300":2,"1267600":2,"1567390":2,"1298910":2,"1264980":2,"1270520":2,"1004510":2,"1348030":2,"1050310":2,"1004520":2,"1265860":2,"1241450":2,"1593330":2,"1264560":2,"1004610":2,"1270650":2,"1557640":2,"1557650":2,"1054570":2,"1270670":2,"1270690":2,"1348170":2,"2827352":2,"1269290":2,"1270760":2,"1051540":2,"1440980":2,"1441000":2,"1290590":2,"1051840":2,"1051860":2,"1290360":2,"1052330":2,"1258500":2,"1289480":2,"1054850":2,"1296440":2,"1292760":2,"1295310":2,"1292200":2,"1294850":2,"1295110":2,"1296200":2,"1296660":2,"1056150":2,"1226970":2,"1593650":2,"1397830":2,"1329110":2,"1576030":2,"1388170":2,"1207730":2,"1298320":2,"1297710":2,"1298120":2,"1297760":2,"1297790":2,"1418260":2,"1565670":2,"1306390":2,"1585630":2,"1291990":2,"1593780":2,"1291090":2,"1306570":2,"1306470":2,"1399830":2,"1609820":2,"1322170":2,"1552390":2,"1298800":2,"1299280":2,"1005190":2,"1400300":2,"1593820":2,"1299640":2,"1291980":2,"1556740":2,"1519120":2,"1556750":2,"1291050":2,"1057960":2,"1403000":2,"1399520":2,"1299970":2,"1303930":2,"1304330":2,"1303820":2,"1058760":2,"1303230":2,"1305130":2,"1594050":2,"1059300":2,"1059400":2,"1315250":2,"1631970":2,"1317400":2,"1609860":2,"1306640":2,"1307090":2,"1307100":2,"1315960":2,"1307130":2,"1497060":2,"1311900":2,"1497020":2,"1533740":2,"1315790":2,"1317080":2,"1307250":2,"1307570":2,"1317900":2,"1594270":2,"1307740":2,"1318110":2,"1316290":2,"1307990":2,"1310920":2,"1185370":2,"1185940":2,"1317810":2,"1320920":2,"1320410":2,"1005550":2,"1321200":2,"1321240":2,"1320490":2,"1319710":2,"1321430":2,"1358800":2,"1321480":2,"1321530":2,"1321560":2,"1320250":2,"1309910":2,"1311340":2,"1315060":2,"1476050":2,"1421420":2,"1569620":2,"1311600":2,"1427460":2,"1594520":2,"1321670":2,"1421490":2,"1005610":2,"1311060":2,"1594590":2,"1594600":2,"1320390":2,"1064980":2,"1322720":2,"1005630":2,"1323370":2,"1324870":2,"1323120":2,"1323170":2,"1322120":2,"1322890":2,"1005650":2,"1061440":2,"1005670":2,"1323280":2,"1568640":2,"1005970":2,"1333600":2,"2841455":2,"1333620":2,"1333680":2,"1333110":2,"1332170":2,"1595360":2,"1595370":2,"1332950":2,"1336570":2,"1331780":2,"1331300":2,"1336770":2,"1333040":2,"1336900":2,"1336980":2,"1337830":2,"1337500":2,"1337630":2,"1329740":2,"1325420":2,"1338600":2,"1340840":2,"1339660":2,"1330240":2,"1326290":2,"1330090":2,"1341340":2,"1342110":2,"1342230":2,"1342340":2,"1341910":2,"1341930":2,"1350140":2,"1347880":2,"1305510":2,"1347640":2,"1356930":2,"1435520":2,"1352930":2,"1346740":2,"1350220":2,"1351930":2,"1352710":2,"1352090":2,"1347080":2,"1355270":2,"1353410":2,"1378660":2,"1348370":2,"1347180":2,"1350810":2,"1350270":2,"1346220":2,"1356960":2,"1351960":2,"1346230":2,"1580280":2,"1350370":2,"1377980":2,"1378030":2,"1580310":2,"1351120":2,"1342710":2,"1344550":2,"1358410":2,"1357550":2,"1342820":2,"1344090":2,"1358430":2,"1062820":2,"1344120":2,"1344130":2,"1583050":2,"1595070":2,"1062910":2,"1311420":2,"1312820":2,"1335520":2,"1397270":2,"1595120":2,"1361590":2,"1363600":2,"1359070":2,"1360750":2,"1363130":2,"1368580":2,"1580570":2,"1365480":2,"1359850":2,"1369140":2,"1369400":2,"1362810":2,"1362530":2,"1365420":2,"1366280":2,"1364940":2,"1370270":2,"1609990":2,"1372350":2,"1371660":2,"1371780":2,"1370980":2,"1371210":2,"1371880":2,"1371910":2,"1372790":2,"1372010":2,"1372040":2,"1372060":2,"1372180":2,"1595940":2,"1584380":2,"1067480":2,"1370370":2,"1373520":2,"1277460":2,"1595570":2,"1450510":2,"1253790":2,"1068230":2,"1595610":2,"1370380":2,"1068870":2,"1557580":2,"1554380":2,"1069370":2,"1070220":2,"1006120":2,"1304280":2,"1070320":2,"1071000":2,"1071100":2,"1397340":2,"1450900":2,"1072240":2,"1370490":2,"1073570":2,"1595750":2,"1610020":2,"1521510":2,"1373680":2,"1401360":2,"1073760":2,"1006420":2,"2008600":2,"1298670":2,"1569240":2,"1595920":2,"1006460":2,"1373810":2,"1375190":2,"1382090":2,"1380650":2,"1374810":2,"1375390":2,"1378240":2,"1381570":2,"1376190":2,"1378320":2,"1379230":2,"1379370":2,"1376060":2,"1379410":2,"1375470":2,"1376240":2,"1375860":2,"1375520":2,"1377920":2,"1378100":2,"1375880":2,"1381140":2,"1472860":2,"1383560":2,"1596090":2,"1385370":2,"1385350":2,"2008620":2,"1385480":2,"1374400":2,"1610700":2,"1475720":2,"1075160":2,"1006570":2,"1279130":2,"1074740":2,"1956550":2,"1392910":2,"1390950":2,"1395340":2,"1395410":2,"1390730":2,"1389810":2,"1596200":2,"1888910":2,"1388030":2,"1388110":2,"1075060":2,"1389730":2,"1596210":2,"1396020":2,"1390760":2,"1391880":2,"1400820":2,"1982210":2,"1299370":2,"1403200":2,"1399120":2,"1596370":2,"1398420":2,"1402160":2,"1403720":2,"1596440":2,"1403310":2,"1402850":2,"1402060":2,"1401820":2,"1402870":2,"1405710":2,"1596730":2,"1405030":2,"1404570":2,"1404590":2,"1405080":2,"1397240":2,"1396820":2,"1006740":2,"1596570":2,"1006880":2,"2547920":2,"1006850":2,"1006900":2,"1238460":2,"1581900":2,"2055520":2,"1576360":2,"1406110":2,"1406120":2,"1596700":2,"1406140":2,"1983710":2,"1406770":2,"1442840":2,"1415270":2,"1413250":2,"1413690":2,"1409390":2,"1408280":2,"1410050":2,"1412970":2,"1410080":2,"1414110":2,"1409550":2,"1409560":2,"1414380":2,"1409580":2,"1415090":2,"1415490":2,"1412340":2,"1076120":2,"1076680":2,"1076890":2,"1076900":2,"1410290":2,"1442810":2,"1386700":2,"1409000":2,"1283240":2,"1280950":2,"1415520":2,"1596830":2,"1596840":2,"1596860":2,"1422230":2,"1344380":2,"1416190":2,"1356780":2,"1551350":2,"1288480":2,"1597045":2,"2857436":2,"1416560":2,"1408540":2,"1597130":2,"1548380":2,"1404920":2,"1077110":2,"1574550":2,"1552650":2,"1077140":2,"1597190":2,"1573390":2,"1552630":2,"1007500":2,"1404750":2,"1419950":2,"1418640":2,"1597260":2,"1418760":2,"1418990":2,"1418460":2,"1419660":2,"1417670":2,"1419300":2,"1419740":2,"1597300":2,"1381210":2,"1622630":2,"1578110":2,"1242520":2,"1242230":2,"1554940":2,"1389020":2,"1421130":2,"1420620":2,"1421360":2,"1337560":2,"1337570":2,"1337590":2,"1077740":2,"1421380":2,"1421500":2,"1983730":2,"1597480":2,"1423680":2,"1424490":2,"1426190":2,"1424690":2,"1424710":2,"1425030":2,"1425240":2,"1429410":2,"1427980":2,"1430030":2,"1430040":2,"1429200":2,"1429240":2,"1430070":2,"1430240":2,"1430080":2,"1430130":2,"1429290":2,"1078240":2,"1430930":2,"1431310":2,"1431330":2,"1431440":2,"1431600":2,"1427220":2,"1430800":2,"1597720":2,"1303420":2,"1303430":2,"1303460":2,"1612710":2,"1303490":2,"1432460":2,"1345470":2,"1433050":2,"1433140":2,"1983740":2,"1433470":2,"1433490":2,"1433560":2,"1433570":2,"1433600":2,"1597790":2,"1456770":2,"1456780":2,"1255780":2,"1441400":2,"1456890":2,"1316400":2,"1610400":2,"1441900":2,"1456940":2,"1240820":2,"1280880":2,"1251870":2,"1251880":2,"1251910":2,"1552890":2,"1433820":2,"1433830":2,"1573400":2,"1226480":2,"1382970":2,"1433880":2,"1177680":2,"1236230":2,"1434050":2,"1434020":2,"1433980":2,"1328020":2,"1435400":2,"1435410":2,"1434250":2,"1435510":2,"1435540":2,"1434920":2,"1434960":2,"1435020":2,"1339910":2,"1598540":2,"1328250":2,"1078830":2,"1340600":2,"1340610":2,"1437290":2,"1327770":2,"1582410":2,"1327660":2,"1339630":2,"1598330":2,"1437820":2,"1598350":2,"1438010":2,"1080030":2,"1598400":2,"1328030":2,"1338710":2,"1338720":2,"1350840":2,"1350860":2,"1440600":2,"1441960":2,"1443170":2,"1441660":2,"1442110":2,"1443620":2,"1598460":2,"1704220":2,"1443630":2,"1582030":2,"1443720":2,"1081120":2,"1443790":2,"1443810":2,"1598590":2,"1582390":2,"1449670":2,"1452000":2,"1454420":2,"1449710":2,"1451350":2,"1447910":2,"1449210":2,"1447270":2,"1444800":2,"1008950":2,"1008960":2,"1448730":2,"1448500":2,"1449220":2,"1449510":2,"1450590":2,"1448760":2,"1448230":2,"1454000":2,"1432940":2,"1546040":2,"1389970":2,"1009050":2,"1546050":2,"1595080":2,"1454970":2,"1455080":2,"1455200":2,"1455210":2,"1455250":2,"1546090":2,"1546070":2,"2850084":2,"1349400":2,"1598730":2,"1445000":2,"1267050":2,"1320570":2,"1009210":2,"1598800":2,"2657130":2,"1445740":2,"1598890":2,"1474860":2,"1444010":2,"1598960":2,"1326880":2,"1326790":2,"1326770":2,"1599160":2,"1514140":2,"1087100":2,"1562970":2,"1457830":2,"1458650":2,"1089930":2,"2856318":2,"1426000":2,"1610950":2,"1599430":2,"1581690":2,"1426100":2,"1156890":2,"2835808":2,"1181390":2,"2861111":2,"1599500":2,"1632290":2,